#### Terragrunt Format and Style 🖌`success`
#### Terragrunt Initialization ⚙️`success`
#### Terragrunt Plan 📖`success`
#### Terragrunt Validation 🤖`success`

<details><summary>Show Plan</summary>

```

aws_route53_zone.this["public"]: Refreshing state... [id=Z0435032UBOTXJWG12IM]
module.kms.data.aws_partition.current: Reading...
data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.kms.data.aws_caller_identity.current: Reading...
module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_region.current: Read complete after 0s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
data.aws_caller_identity.current: Read complete after 0s [id=147194901644]
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=147194901644]
data.aws_iam_policy_document.logs_policy: Reading...
data.aws_iam_policy_document.logs_policy: Read complete after 0s [id=703442375]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=289466135]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=ebb6b590-abab-4f1d-ae44-e0d8ac7a78d6]
module.kms.aws_kms_alias.this["workload-dev-kms"]: Refreshing state... [id=alias/workload-dev-kms]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_vpc.this[0]: Refreshing state... [id=vpc-0d94ad3dc3cf9d85c]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-014282ca4ee0f3cc9]
aws_route_table.private[0]: Refreshing state... [id=rtb-0073747fb42ccdab4]
aws_subnet.private[1]: Refreshing state... [id=subnet-0c922c6a98dcf1e3b]
aws_subnet.public[0]: Refreshing state... [id=subnet-07cc71c8ccae57316]
aws_subnet.public[1]: Refreshing state... [id=subnet-06bd693a610ba1902]
aws_subnet.public[2]: Refreshing state... [id=subnet-0818b77399efcd5c4]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-036440546d8eb0c76]
aws_subnet.private[2]: Refreshing state... [id=subnet-08c7c8dc742580a6e]
aws_default_security_group.this[0]: Refreshing state... [id=sg-07db7ad127aca9b9c]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-09f7900d0480aed0a]
aws_route_table.public[0]: Refreshing state... [id=rtb-005957174f54f5c6d]
aws_subnet.private[0]: Refreshing state... [id=subnet-0968647d51820050b]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b588fcc72e3cd5f3]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-005957174f54f5c6d1080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01739f9831d365050]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-064aae29ec5049a56]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f4adf4b730a8d5ea]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0787749d2487d9d0a]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0790709fe9bd34646]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.wrapper["thesamcro_wildcard"].aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:147194901644:certificate/ec2e56c8-2a4a-45bd-baad-c5b494916641]
module.wrapper["thesamcro_wildcard"].aws_route53_record.validation[0]: Refreshing state... [id=Z0435032UBOTXJWG12IM__f969685d8ee6d9edd3fbc1913b71a280.thesamcro.com._CNAME]
aws_cloudwatch_log_group.ecs: Refreshing state... [id=/aws/ecs/workload-dev-ecs-cluster-fargate]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:147194901644:cluster/workload-dev-ecs-cluster-fargate]
module.wrapper["thesamcro_wildcard"].aws_acm_certificate_validation.this[0]: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.ecs.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=workload-dev-ecs-cluster-fargate]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.wrapper["jenkins_controller_ecs"].data.aws_caller_identity.current: Reading...
module.wrapper["jenkins_controller_ecs"].data.aws_partition.current: Reading...
module.wrapper["jenkins_controller_ecs"].aws_ecr_repository.this[0]: Refreshing state... [id=jenkins-controller-ecs]
module.wrapper["jenkins_controller_ecs"].data.aws_partition.current: Read complete after 0s [id=aws]
module.wrapper["jenkins_controller_ecs"].data.aws_caller_identity.current: Read complete after 0s [id=147194901644]
module.wrapper["jenkins_controller_ecs"].data.aws_iam_policy_document.repository[0]: Reading...
module.wrapper["jenkins_controller_ecs"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1565623393]
module.wrapper["jenkins_controller_ecs"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=jenkins-controller-ecs]
module.wrapper["jenkins_controller_ecs"].aws_ecr_repository_policy.this[0]: Refreshing state... [id=jenkins-controller-ecs]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-004eca9c911cc366e]
aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-742260416]
aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2001975679]
aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3841308106]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "workload-dev-ecs-shared-alb"
      + preserve_host_header       = false
      + security_groups            = [
          + "sg-004eca9c911cc366e",
        ]
      + subnets                    = [
          + "subnet-06bd693a610ba1902",
          + "subnet-07cc71c8ccae57316",
          + "subnet-0818b77399efcd5c4",
        ]
      + tags                       = {
          + "Name" = "workload-dev-ecs-shared-alb"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-shared-alb"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Name" = "workload-dev-ecs-shared-alb"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-shared-alb"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.frontend_https[0] will be created
  + resource "aws_lb_listener" "frontend_https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:147194901644:certificate/ec2e56c8-2a4a-45bd-baad-c5b494916641"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags              = {
          + "Name" = "workload-dev-ecs-shared-alb"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "workload-dev-ecs-shared-alb"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "404: Not Found"
              + status_code  = "404"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + http_tcp_listener_arns    = [
      + (known after apply),
    ]
  + http_tcp_listener_ids     = [
      + (known after apply),
    ]
  + https_listener_arns       = [
      + (known after apply),
    ]
  + https_listener_ids        = [
      + (known after apply),
    ]
  + lb_arn                    = (known after apply)
  + lb_arn_suffix             = (known after apply)
  + lb_dns_name               = (known after apply)
  + lb_id                     = (known after apply)
  + lb_zone_id                = (known after apply)
  + target_group_arn_suffixes = []
  + target_group_arns         = []
  + target_group_attachments  = {}
  + target_group_names        = []

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
module.route53_record.data.aws_route53_zone.this[0]: Reading...
data.aws_iam_policy_document.ecs_assume_role_policy: Reading...
data.aws_partition.current: Reading...
module.jenkins_controller_ecs_service_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0171010b7c541ecb8]
data.aws_region.current: Reading...
aws_lb_target_group.jenkins_controller: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:147194901644:targetgroup/alb-http-jenkins-controller/0f6235b99556188b]
aws_cloudwatch_log_group.jenkins_controller: Refreshing state... [id=/aws/ecs/workload-dev-ecs-cluster-fargate/jenkins/controller]
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.ecs_assume_role_policy: Read complete after 0s [id=320642683]
data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_iam_role.contoller_task_execution_role: Refreshing state... [id=jenkins-controller-ecs-task-execution-role]
aws_iam_role.controller_task_role: Refreshing state... [id=jenkins-controller-ecs-task]
data.aws_caller_identity.current: Read complete after 1s [id=147194901644]
data.aws_iam_policy_document.controller_task_role_policy: Reading...
data.aws_iam_policy_document.controller_task_role_policy: Read complete after 0s [id=2167807251]
aws_iam_policy.controller_task_role_policy: Refreshing state... [id=arn:aws:iam::147194901644:policy/jenkins-controller-ecs-task-role-policy]
aws_iam_role_policy_attachment.contoller_task_execution_role_policy_attachment: Refreshing state... [id=jenkins-controller-ecs-task-execution-role-20230212140425308100000003]
aws_ecs_task_definition.jenkins_controller: Refreshing state... [id=jenkins-controller]
aws_iam_role_policy_attachment.controller_task_role_policy_attachment: Refreshing state... [id=jenkins-controller-ecs-task-20230212140424726400000002]
module.jenkins_controller_ecs_service_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4062328340]
module.jenkins_controller_ecs_service_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-3684487373]
aws_ecs_service.jenkins_controller: Refreshing state... [id=arn:aws:ecs:us-east-1:147194901644:service/workload-dev-ecs-cluster-fargate/jenkins-controller]
aws_lb_listener_rule.jenkins_controller: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:147194901644:listener-rule/app/workload-dev-ecs-shared-alb/19770d104370ba3c/562fca7d6370b095/1e14d4a64c58427d]
module.route53_record.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z0435032UBOTXJWG12IM]
module.route53_record.aws_route53_record.this["jenkins A"]: Refreshing state... [id=Z0435032UBOTXJWG12IM_jenkins.thesamcro.com_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.route53_record.aws_route53_record.this["jenkins A"] has changed
  ~ resource "aws_route53_record" "this" {
        id                               = "Z0435032UBOTXJWG12IM_jenkins.thesamcro.com_A"
      + multivalue_answer_routing_policy = false
        name                             = "jenkins.thesamcro.com"
      + records                          = []
      + ttl                              = 0
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb_listener_rule.jenkins_controller will be created
  + resource "aws_lb_listener_rule" "jenkins_controller" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:us-east-1:123456789012:listener/app/lb-name/1234567890123456/1234567890123456"
      + priority     = 100
      + tags_all     = {
          + "Environment" = "dev"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "infraops"
          + "Terraform"   = "true"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:147194901644:targetgroup/alb-http-jenkins-controller/0f6235b99556188b"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "jenkins.thesamcro.com",
                ]
            }
        }
    }

  # module.route53_record.aws_route53_record.this["jenkins A"] will be updated in-place
  ~ resource "aws_route53_record" "this" {
        id                               = "Z0435032UBOTXJWG12IM_jenkins.thesamcro.com_A"
        name                             = "jenkins.thesamcro.com"
        # (7 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "workload-dev-ecs-shared-alb-2036151487.us-east-1.elb.amazonaws.com" -> "fake-dns-name"
          ~ zone_id                = "Z35SXDOTRQ7X7K" -> "fake-zone-id"
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @obstaclex, Action: `pull_request`, Working Directory: `workload`, Workflow: `Terragrunt CI/CD pipeline`*